Revit 2024 API
RebarContainerItem.HasPresentationOverrides Method
 Identifies if this rebar set has overridden default presentation settings for the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool HasPresentationOverrides(
	View dBView
)
Visual Basic
Public Function HasPresentationOverrides ( _
	dBView As View _
) As Boolean
Visual C++
public:
bool HasPresentationOverrides(
	View^ dBView
)
Parameters
dBView
Type: Autodesk.Revit.DB.View
 The view.
Return Value
 True if this rebar set has overriden default presentation settings, false otherwise.
Remarks
 Default presentation settings can be overriden using SetBarHiddenStatus(View, Int32, Boolean), SetPresentationMode(View, RebarPresentationMode) methods
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace